nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/location/location_shell.c
/*
 * Copyright (c) 2021 Nordic Semiconductor ASA
 *
 * SPDX-License-Identifier: LicenseRef-Nordic-5-Clause
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <zephyr/shell/shell.h>
#include <getopt.h>
#include <net/nrf_cloud.h>
#if defined(CONFIG_NRF_CLOUD_REST)
#include <net/nrf_cloud_rest.h>
#endif
#include <modem/location.h>
#include <dk_buttons_and_leds.h>
#if defined(CONFIG_MOSH_CLOUD_LWM2M)
#include <net/lwm2m_client_utils_location.h>
#include "cloud_lwm2m.h"
#endif

#include "mosh_print.h"
#include "location_cmd_utils.h"

#include "mosh_defines.h"

#if defined(CONFIG_MOSH_CLOUD_LWM2M)
/* Location Assistance resource IDs */
#define GROUND_FIX_SEND_LOCATION_BACK	0
#define GROUND_FIX_RESULT_CODE		1
#define GROUND_FIX_LATITUDE		2
#define GROUND_FIX_LONGITUDE		3
#define GROUND_FIX_ACCURACY		4
#endif

enum location_shell_command {
	LOCATION_CMD_NONE = 0,
	LOCATION_CMD_GET,
	LOCATION_CMD_CANCEL
};
extern struct k_work_q mosh_common_work_q;

/* Work for sending acquired location to nRF Cloud */
struct gnss_location_work_data {
	struct k_work work;

	enum nrf_cloud_gnss_type format;

	/* Data from location event */
	struct location_event_data loc_evt_data;
};
static struct gnss_location_work_data gnss_location_work_data;


#if defined(CONFIG_DK_LIBRARY)
static struct k_work_delayable location_evt_led_work;
#endif

/******************************************************************************/
static const char location_usage_str[] =
	"Usage: location <subcommand> [options]\n"
	"\n"
	"Subcommands:\n"
	"  get:      Requests the current position or starts periodic position updates.\n"
	"  cancel:   Cancel/stop on going request. No options\n";

static const char location_get_usage_str[] =
	"Usage: location get [--mode <mode>] [--method <method>]\n"
	"[--timeout <msecs>] [--interval <secs>]\n"
	"[--gnss_accuracy <acc>] [--gnss_num_fixes <number of fixes>]\n"
	"[--gnss_timeout <timeout in msecs>] [--gnss_visibility]\n"
	"[--gnss_priority] [--gnss_cloud_nmea] [--gnss_cloud_pvt]\n"
	"[--cellular_timeout <timeout in msecs>] [--cellular_service <service_string>]\n"
	"[--wifi_timeout <timeout in msecs>] [--wifi_service <service_string>]\n"
	"Options:\n"
	"  -m, --method,       Location method: 'gnss', 'cellular' or 'wifi'. Multiple\n"
	"                      '--method' parameters may be given to indicate list of\n"
	"                      methods in priority order.\n"
	"  --mode,             Location request mode: 'fallback' (default) or 'all'.\n"
	"  --interval,         Position update interval in seconds\n"
	"                      (default: 0 = single position)\n"
	"  -t, --timeout,      Timeout for the entire location request in milliseconds.\n"
	"                      Zero means timeout is disabled.\n"
	"  --gnss_accuracy,    Used GNSS accuracy: 'low', 'normal' or 'high'\n"
	"  --gnss_num_fixes,   Number of consecutive fix attempts (if gnss_accuracy\n"
	"                      set to 'high', default: 3)\n"
	"  --gnss_timeout,     GNSS timeout in milliseconds. Zero means timeout is disabled.\n"
	"  --gnss_visibility,  Enables GNSS obstructed visibility detection\n"
	"  --gnss_priority,    Enables GNSS priority mode\n"
	"  --gnss_cloud_nmea,  Send acquired GNSS location to nRF Cloud formatted as NMEA\n"
	"  --gnss_cloud_pvt,   Send acquired GNSS location to nRF Cloud formatted as PVT\n"
	"  --cellular_timeout, Cellular timeout in milliseconds. Zero means timeout is disabled.\n"
	"  --cellular_service, Used cellular positioning service:\n"
	"                      'any' (default), 'nrf' or 'here'\n"
	"  --wifi_timeout,     Wi-Fi timeout in milliseconds. Zero means timeout is disabled.\n"
	"  --wifi_service,     Used Wi-Fi positioning service:\n"
	"                      'any' (default), 'nrf' or 'here'\n";

/******************************************************************************/

/* Following are not having short options */
enum {
	LOCATION_SHELL_OPT_INTERVAL         = 1001,
	LOCATION_SHELL_OPT_MODE,
	LOCATION_SHELL_OPT_GNSS_ACCURACY,
	LOCATION_SHELL_OPT_GNSS_TIMEOUT,
	LOCATION_SHELL_OPT_GNSS_NUM_FIXES,
	LOCATION_SHELL_OPT_GNSS_VISIBILITY,
	LOCATION_SHELL_OPT_GNSS_PRIORITY_MODE,
	LOCATION_SHELL_OPT_GNSS_LOC_CLOUD_NMEA,
	LOCATION_SHELL_OPT_GNSS_LOC_CLOUD_PVT,
	LOCATION_SHELL_OPT_CELLULAR_TIMEOUT,
	LOCATION_SHELL_OPT_CELLULAR_SERVICE,
	LOCATION_SHELL_OPT_WIFI_TIMEOUT,
	LOCATION_SHELL_OPT_WIFI_SERVICE,
};

/* Specifying the expected options */
static struct option long_options[] = {
	{ "method", required_argument, 0, 'm' },
	{ "mode", required_argument, 0, LOCATION_SHELL_OPT_MODE },
	{ "interval", required_argument, 0, LOCATION_SHELL_OPT_INTERVAL },
	{ "timeout", required_argument, 0, 't' },
	{ "gnss_accuracy", required_argument, 0, LOCATION_SHELL_OPT_GNSS_ACCURACY },
	{ "gnss_timeout", required_argument, 0, LOCATION_SHELL_OPT_GNSS_TIMEOUT },
	{ "gnss_num_fixes", required_argument, 0, LOCATION_SHELL_OPT_GNSS_NUM_FIXES },
	{ "gnss_visibility", no_argument, 0, LOCATION_SHELL_OPT_GNSS_VISIBILITY },
	{ "gnss_priority", no_argument, 0, LOCATION_SHELL_OPT_GNSS_PRIORITY_MODE },
	{ "gnss_cloud_nmea", no_argument, 0, LOCATION_SHELL_OPT_GNSS_LOC_CLOUD_NMEA },
	{ "gnss_cloud_pvt", no_argument, 0, LOCATION_SHELL_OPT_GNSS_LOC_CLOUD_PVT },
	{ "cellular_timeout", required_argument, 0, LOCATION_SHELL_OPT_CELLULAR_TIMEOUT },
	{ "cellular_service", required_argument, 0, LOCATION_SHELL_OPT_CELLULAR_SERVICE },
	{ "wifi_timeout", required_argument, 0, LOCATION_SHELL_OPT_WIFI_TIMEOUT },
	{ "wifi_service", required_argument, 0, LOCATION_SHELL_OPT_WIFI_SERVICE },
	{ 0, 0, 0, 0 }
};

static bool gnss_location_to_cloud;
static enum nrf_cloud_gnss_type gnss_location_to_cloud_format;

/******************************************************************************/

static void location_shell_print_usage(const struct shell *shell,
				       enum location_shell_command command)
{
	switch (command) {
	case LOCATION_CMD_GET:
		mosh_print_no_format(location_get_usage_str);
		break;

	default:
		mosh_print_no_format(location_usage_str);
		break;
	}
}

#define MOSH_LOC_SERVICE_NONE 0xFF

static enum location_service location_shell_string_to_service(const char *service_str)
{
	enum location_service service = MOSH_LOC_SERVICE_NONE;

	if (strcmp(service_str, "any") == 0) {
		service = LOCATION_SERVICE_ANY;
	} else if (strcmp(service_str, "nrf") == 0) {
		service = LOCATION_SERVICE_NRF_CLOUD;
	} else if (strcmp(service_str, "here") == 0) {
		service = LOCATION_SERVICE_HERE;
	}

