nrfconnect/sdk-nrf/samples/nrf9160/modem_shell/src/location/location_shell.c
exit:
	if (err) {
		location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
	}
#else /* !CONFIG_MOSH_CLOUD_LWM2M */
	location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
#endif
}
#endif /* CONFIG_LOCATION_METHOD_CELLULAR_EXTERNAL */

void location_ctrl_event_handler(const struct location_event_data *event_data)
{
	switch (event_data->id) {
	case LOCATION_EVT_LOCATION:
		mosh_print("Location:");
		mosh_print(
			"  used method: %s (%d)",
			location_method_str(event_data->method),
			event_data->method);
		mosh_print("  latitude: %.06f", event_data->location.latitude);
		mosh_print("  longitude: %.06f", event_data->location.longitude);
		mosh_print("  accuracy: %.01f m", event_data->location.accuracy);
		if (event_data->location.datetime.valid) {
			mosh_print(
				"  date: %04d-%02d-%02d",
				event_data->location.datetime.year,
				event_data->location.datetime.month,
				event_data->location.datetime.day);
			mosh_print(
				"  time: %02d:%02d:%02d.%03d UTC",
				event_data->location.datetime.hour,
				event_data->location.datetime.minute,
				event_data->location.datetime.second,
				event_data->location.datetime.ms);
		}
		mosh_print(
			"  Google maps URL: https://maps.google.com/?q=%f,%f",
			event_data->location.latitude, event_data->location.longitude);

		if (gnss_location_to_cloud) {
			k_work_init(&gnss_location_work_data.work, location_to_cloud_worker);

			gnss_location_work_data.loc_evt_data = *event_data;
			gnss_location_work_data.format = gnss_location_to_cloud_format;
			k_work_submit_to_queue(&mosh_common_work_q, &gnss_location_work_data.work);
		}

#if defined(CONFIG_DK_LIBRARY)
		dk_set_led_on(LOCATION_STATUS_LED);
		k_work_reschedule_for_queue(&mosh_common_work_q, &location_evt_led_work,
			K_SECONDS(5));
#endif
		break;

	case LOCATION_EVT_TIMEOUT:
		mosh_error("Location request timed out");
		break;

	case LOCATION_EVT_ERROR:
		mosh_error("Location request failed");
		break;
	case LOCATION_EVT_GNSS_ASSISTANCE_REQUEST:
#if defined(CONFIG_LOCATION_METHOD_GNSS_AGPS_EXTERNAL)
		mosh_print(
			"A-GPS request from Location library "
			"(ephe: 0x%08x alm: 0x%08x flags: 0x%02x)",
			event_data->agps_request.sv_mask_ephe,
			event_data->agps_request.sv_mask_alm,
			event_data->agps_request.data_flags);
		location_ctrl_agps_ext_handle(&event_data->agps_request);
#endif
		break;
	case LOCATION_EVT_GNSS_PREDICTION_REQUEST:
#if defined(CONFIG_LOCATION_METHOD_GNSS_PGPS_EXTERNAL)
		mosh_print(
			"P-GPS request from Location library "
			"(prediction count: %d validity time: %d gps day: %d time of day: %d)",
			event_data->pgps_request.prediction_count,
			event_data->pgps_request.prediction_period_min,
			event_data->pgps_request.gps_day,
			event_data->pgps_request.gps_time_of_day);
		location_ctrl_pgps_ext_handle(&event_data->pgps_request);
#endif
		break;
	case LOCATION_EVT_CELLULAR_EXT_REQUEST:
#if defined(CONFIG_LOCATION_METHOD_CELLULAR_EXTERNAL)
		mosh_print("Cellular location request from Location library "
			   "(neighbor cells: %d GCI cells: %d)",
			   event_data->cellular_request.ncells_count,
			   event_data->cellular_request.gci_cells_count);
		location_ctrl_cellular_ext_handle(&event_data->cellular_request);
#endif
		break;
	case LOCATION_EVT_RESULT_UNKNOWN:
		mosh_print("Location request completed, but the result is not known");
		break;
	default:
		mosh_warn("Unknown event from location library, id %d", event_data->id);
		break;
	}
}

void location_ctrl_init(void)
{
	int ret;

#if defined(CONFIG_DK_LIBRARY)
	k_work_init_delayable(&location_evt_led_work, location_evt_led_worker);
#endif

	ret = location_init(location_ctrl_event_handler);
	if (ret) {
		mosh_error("Initializing the Location library failed, err: %d\n", ret);
	}
}

/******************************************************************************/

int location_shell(const struct shell *shell, size_t argc, char **argv)
{
	enum location_shell_command command = LOCATION_CMD_NONE;

	int interval = 0;
	bool interval_set = false;

	int timeout = 0;
	bool timeout_set = false;

	int gnss_timeout = 0;
	bool gnss_timeout_set = false;

	enum location_accuracy gnss_accuracy = 0;
	bool gnss_accuracy_set = false;

	int gnss_num_fixes = 0;
	bool gnss_num_fixes_set = false;

	bool gnss_visibility = false;

	bool gnss_priority_mode = false;

	int cellular_timeout = 0;
	bool cellular_timeout_set = false;
	enum location_service cellular_service = LOCATION_SERVICE_ANY;

	int wifi_timeout = 0;
	bool wifi_timeout_set = false;
	enum location_service wifi_service = LOCATION_SERVICE_ANY;

	enum location_method method_list[CONFIG_LOCATION_METHODS_LIST_SIZE] = { 0 };
	int method_count = 0;

	enum location_req_mode req_mode = LOCATION_REQ_MODE_FALLBACK;

	int opt;
	int ret = 0;
	int long_index = 0;

	gnss_location_to_cloud_format = NRF_CLOUD_GNSS_TYPE_PVT;

	if (argc < 2) {
		goto show_usage;
	}

	/* command = argv[0] = "location" */
	/* sub-command = argv[1] */
	if (strcmp(argv[1], "get") == 0) {
		command = LOCATION_CMD_GET;
	} else if (strcmp(argv[1], "cancel") == 0) {
		command = LOCATION_CMD_CANCEL;
	} else {
		mosh_error("Unsupported command=%s\n", argv[1]);
		ret = -EINVAL;
		goto show_usage;
	}

	/* Reset getopt due to possible previous failures */
	optreset = 1;

	/* We start from subcmd arguments */
	optind = 2;

	gnss_location_to_cloud = false;

	while ((opt = getopt_long(argc, argv, "m:t:", long_options, &long_index)) != -1) {
		switch (opt) {
		case LOCATION_SHELL_OPT_GNSS_TIMEOUT:
			gnss_timeout = atoi(optarg);
			gnss_timeout_set = true;
			if (gnss_timeout == 0) {
				gnss_timeout = SYS_FOREVER_MS;
			}
			break;

		case LOCATION_SHELL_OPT_GNSS_NUM_FIXES:
			gnss_num_fixes = atoi(optarg);
			gnss_num_fixes_set = true;
			break;
		case LOCATION_SHELL_OPT_GNSS_LOC_CLOUD_NMEA:
			gnss_location_to_cloud_format = NRF_CLOUD_GNSS_TYPE_NMEA;
		/* flow-through */
		case LOCATION_SHELL_OPT_GNSS_LOC_CLOUD_PVT:
			gnss_location_to_cloud = true;
			break;
		case LOCATION_SHELL_OPT_CELLULAR_TIMEOUT:
			cellular_timeout = atoi(optarg);
			cellular_timeout_set = true;
			if (cellular_timeout == 0) {
				cellular_timeout = SYS_FOREVER_MS;
			}
			break;

		case LOCATION_SHELL_OPT_CELLULAR_SERVICE:
			cellular_service = location_shell_string_to_service(optarg);
			if (cellular_service == MOSH_LOC_SERVICE_NONE) {
				mosh_error("Unknown cellular positioning service. See usage:");
				goto show_usage;
			}
			break;

		case LOCATION_SHELL_OPT_WIFI_TIMEOUT:
			wifi_timeout = atoi(optarg);
			wifi_timeout_set = true;
			if (wifi_timeout == 0) {
				wifi_timeout = SYS_FOREVER_MS;
			}
			break;

